In [2]:
import pandas as pd
import numpy  as np

In [3]:
# Create a Series and let Pandas create a default integer index
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
# dtype = float 64
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
# Creating a DataFrame by passing a NumPy array
# with a datetime index and labeled columns
# Type(dates): pandas.core.indexes.datetimes.DatetimeIndex
dates = pd.date_range('20180101', periods=6)

In [6]:
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
# Create a Dataframe here
df = pd.DataFrame(np.random.randn(6, 4),
                 index=dates,
                 columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2018-01-01 -0.142870  0.995796 -0.705316 -0.043987
2018-01-02  1.031795 -0.917170  1.289025  0.307683
2018-01-03 -0.521710  1.325901 -1.213369  1.407042
2018-01-04 -3.029376  0.185764  0.095235  0.340439
2018-01-05 -0.569064  0.536223 -0.836590  1.218813
2018-01-06 -1.775549  0.990005 -0.648953 -1.333965

In [9]:
# Create a DataFrame by passing a dict of objects
# that can be converted to series-like.
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'food'})

In [10]:
df2

     A          B    C  D      E     F
0  1.0 2013-01-02  1.0  3   test  food
1  1.0 2013-01-02  1.0  3  train  food
2  1.0 2013-01-02  1.0  3   test  food
3  1.0 2013-01-02  1.0  3  train  food

In [11]:
# The columns of the resulting DataFrame can have different dtypes
df2.dtypes

# Only for IPython
# df2.<TAB>

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
# how to view the top and bottom rows of the frame
df.head()

                   A         B         C         D
2018-01-01 -0.142870  0.995796 -0.705316 -0.043987
2018-01-02  1.031795 -0.917170  1.289025  0.307683
2018-01-03 -0.521710  1.325901 -1.213369  1.407042
2018-01-04 -3.029376  0.185764  0.095235  0.340439
2018-01-05 -0.569064  0.536223 -0.836590  1.218813

In [13]:
df.tail(3)

                   A         B         C         D
2018-01-04 -3.029376  0.185764  0.095235  0.340439
2018-01-05 -0.569064  0.536223 -0.836590  1.218813
2018-01-06 -1.775549  0.990005 -0.648953 -1.333965

In [14]:
# Display the index
df.index

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
# Display the columns
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
# DataFrame.to_numpy() gives a Numpy representation of the underlaying data
# This can be expensive operation, because numpy array can only be 1 type.
# If your DataFrame has multiple data type, then every single element
# has to be converted into a Python object.

# In our example, it is not an issue because it is of the same type
df.to_numpy()

array([[-0.14286998,  0.99579561, -0.70531559, -0.04398674],
       [ 1.0317953 , -0.91716987,  1.28902465,  0.30768348],
       [-0.52170958,  1.32590125, -1.21336907,  1.40704222],
       [-3.02937592,  0.18576384,  0.09523473,  0.34043874],
       [-0.56906417,  0.53622278, -0.83659013,  1.2188133 ],
       [-1.77554939,  0.99000535, -0.64895263, -1.33396514]])

In [17]:
# For df2, the DataFrame with multiple dtypes, DataFrame.to_numpy() 
# is relatively expensive (slow)
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'food'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'food'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'food'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'food']],
      dtype=object)

In [18]:
# DataFrame.to_numpy() does not include the index or column labels
# in the output. Use describe() shows a quick statistic summary 
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.834462  0.519420 -0.336661  0.316004
std    1.402338  0.809221  0.903478  0.985707
min   -3.029376 -0.917170 -1.213369 -1.333965
25%   -1.473928  0.273379 -0.803771  0.043931
50%   -0.545387  0.763114 -0.677134  0.324061
75%   -0.237580  0.994348 -0.090812  0.999220
max    1.031795  1.325901  1.289025  1.407042

In [19]:
# Transposing your data, capital T
df.T

   2018-01-01  2018-01-02  2018-01-03  2018-01-04  2018-01-05  2018-01-06
A   -0.142870    1.031795   -0.521710   -3.029376   -0.569064   -1.775549
B    0.995796   -0.917170    1.325901    0.185764    0.536223    0.990005
C   -0.705316    1.289025   -1.213369    0.095235   -0.836590   -0.648953
D   -0.043987    0.307683    1.407042    0.340439    1.218813   -1.333965

In [20]:
# Sort by an axis:
# Axis of 1 is the header row, and ascending = False means reverse
# From largest to smallest.
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-01-01 -0.043987 -0.705316  0.995796 -0.142870
2018-01-02  0.307683  1.289025 -0.917170  1.031795
2018-01-03  1.407042 -1.213369  1.325901 -0.521710
2018-01-04  0.340439  0.095235  0.185764 -3.029376
2018-01-05  1.218813 -0.836590  0.536223 -0.569064
2018-01-06 -1.333965 -0.648953  0.990005 -1.775549

In [21]:
# Sort by Values:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2018-01-03 -0.521710  1.325901 -1.213369  1.407042
2018-01-01 -0.142870  0.995796 -0.705316 -0.043987
2018-01-06 -1.775549  0.990005 -0.648953 -1.333965
2018-01-05 -0.569064  0.536223 -0.836590  1.218813
2018-01-04 -3.029376  0.185764  0.095235  0.340439
2018-01-02  1.031795 -0.917170  1.289025  0.307683

In [22]:
# While the standard Python / Numpy expressions works
# For production code we recommend using pandas data access method
# such as .at, .iat, .loc, and .iloc

# Getting
# Selecting a single columns and return a series
# same as using df.A
df['A']

2018-01-01   -0.142870
2018-01-02    1.031795
2018-01-03   -0.521710
2018-01-04   -3.029376
2018-01-05   -0.569064
2018-01-06   -1.775549
Freq: D, Name: A, dtype: float64

In [23]:
# The same as df['A']
# Both returns a series, this one is type float64
df.A

2018-01-01   -0.142870
2018-01-02    1.031795
2018-01-03   -0.521710
2018-01-04   -3.029376
2018-01-05   -0.569064
2018-01-06   -1.775549
Freq: D, Name: A, dtype: float64

In [24]:
# Selecting via [], which slices the rows
df[0:3]

                   A         B         C         D
2018-01-01 -0.142870  0.995796 -0.705316 -0.043987
2018-01-02  1.031795 -0.917170  1.289025  0.307683
2018-01-03 -0.521710  1.325901 -1.213369  1.407042

In [25]:
# Selecting via [], which slices the values of the row
# Does it have to be sorted?
df['20180102':'20180104']

                   A         B         C         D
2018-01-02  1.031795 -0.917170  1.289025  0.307683
2018-01-03 -0.521710  1.325901 -1.213369  1.407042
2018-01-04 -3.029376  0.185764  0.095235  0.340439

In [26]:
# Selection by Label

# For getting a cross section using a label
# Get the cross section of a given row, 
# dates[0] is 20180102
df.loc[dates[0]]

A   -0.142870
B    0.995796
C   -0.705316
D   -0.043987
Name: 2018-01-01 00:00:00, dtype: float64

In [27]:
# Selecting on a multi-axis by label
# Select all the rows, and column and index
# df.loc[row_range, column_range]
# df.loc[row_list, column_list]
df.loc[:, ['A', 'B']]

# Label slicing, both endpoints are included
df.loc['20180102':'20180104', 'B':'D']

# By range of the rows
# The column you can't slice by index ...
# This will give an error message
# df.loc[0:3, 0:1]

                   B         C         D
2018-01-02 -0.917170  1.289025  0.307683
2018-01-03  1.325901 -1.213369  1.407042
2018-01-04  0.185764  0.095235  0.340439

In [28]:
# Reduction in the dimensions of the returned object
# pandas.core.series.Series
df.loc['20180103', ['A', 'B']]

A   -0.521710
B    1.325901
Name: 2018-01-03 00:00:00, dtype: float64

In [29]:
# For getting a scalar value (Number)
df.loc[dates[0], 'A']

-0.1428699796933611

In [30]:
# For fastest access to a scala (equivalent to the prior method)
# one uses at, the slower one is loc
df.at[dates[0], 'A']

-0.1428699796933611

# Selection by Position

In [31]:
# Select via the position of the passed integers
# This is the data from row 4
print(df)
df.iloc[3]

                   A         B         C         D
2018-01-01 -0.142870  0.995796 -0.705316 -0.043987
2018-01-02  1.031795 -0.917170  1.289025  0.307683
2018-01-03 -0.521710  1.325901 -1.213369  1.407042
2018-01-04 -3.029376  0.185764  0.095235  0.340439
2018-01-05 -0.569064  0.536223 -0.836590  1.218813
2018-01-06 -1.775549  0.990005 -0.648953 -1.333965

A   -3.029376
B    0.185764
C    0.095235
D    0.340439
Name: 2018-01-04 00:00:00, dtype: float64

In [32]:
# By integer slices, similiar to numpy and python
df.iloc[3:5, 0:2]

                   A         B
2018-01-04 -3.029376  0.185764
2018-01-05 -0.569064  0.536223

In [33]:
# By lists of integer position locations, similiar to the numpy
# and python style.
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2018-01-02  1.031795  1.289025
2018-01-03 -0.521710 -1.213369
2018-01-05 -0.569064 -0.836590

In [34]:
# For slicing rows explicitly
df.iloc[1:3, :]

                   A         B         C         D
2018-01-02  1.031795 -0.917170  1.289025  0.307683
2018-01-03 -0.521710  1.325901 -1.213369  1.407042

In [35]:
# For slicing columns explicitly
df.iloc[:, 1:3]

                   B         C
2018-01-01  0.995796 -0.705316
2018-01-02 -0.917170  1.289025
2018-01-03  1.325901 -1.213369
2018-01-04  0.185764  0.095235
2018-01-05  0.536223 -0.836590
2018-01-06  0.990005 -0.648953

In [36]:
# For getting a value explicitly
df.iloc[1, 1]

-0.9171698654775249

In [37]:
# For faster access to a scalar 
df.iat[1, 1]

-0.9171698654775249

# Boolean Indexing

In [38]:
# Using a single column's value to select data
df[df.A > 0]

                   A        B         C         D
2018-01-02  1.031795 -0.91717  1.289025  0.307683

In [39]:
# Selecting values from a DataFrame where boolean condition is met
df[df > 0]

                   A         B         C         D
2018-01-01       NaN  0.995796       NaN       NaN
2018-01-02  1.031795       NaN  1.289025  0.307683
2018-01-03       NaN  1.325901       NaN  1.407042
2018-01-04       NaN  0.185764  0.095235  0.340439
2018-01-05       NaN  0.536223       NaN  1.218813
2018-01-06       NaN  0.990005       NaN       NaN

In [40]:
# using the isin() method for filtering
df2 = df.copy()

# Adding a new column by giving it value
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2018-01-01 -0.142870  0.995796 -0.705316 -0.043987    one
2018-01-02  1.031795 -0.917170  1.289025  0.307683    one
2018-01-03 -0.521710  1.325901 -1.213369  1.407042    two
2018-01-04 -3.029376  0.185764  0.095235  0.340439  three
2018-01-05 -0.569064  0.536223 -0.836590  1.218813   four
2018-01-06 -1.775549  0.990005 -0.648953 -1.333965  three

In [41]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2018-01-03 -0.521710  1.325901 -1.213369  1.407042   two
2018-01-05 -0.569064  0.536223 -0.836590  1.218813  four

# Setting

In [42]:
# Setting a new column automatically aligns the data
s1 = pd.Series([1, 2, 3, 4, 5, 6], 
               index=pd.date_range('20180102', periods=6))
df['F'] = s1
s1

2018-01-02    1
2018-01-03    2
2018-01-04    3
2018-01-05    4
2018-01-06    5
2018-01-07    6
Freq: D, dtype: int64

In [43]:
# Setting values by label
df.at[dates[0], 'A'] = 0

# Setting values by position
df.iat[0, 1] = 0

# Setting by assigning with a Numpy Array:
df.loc[:, 'D'] = np.array([5] * len(df))

In [44]:
# A where operation with setting
df2 = df.copy()

# If the values of df2 is greater 0, then assign a negative values
# or multiply by -1
df[df2 > 0] = -df2

# Missing DataM

In [45]:
# Pandas's Axis, 0 = rows, 1 = columns
# https://i.stack.imgur.com/YiAo9.png

In [46]:
# Pandas use np.nan to represent missing data, this is by default not included
# in the comutations. Reindexing allows you to change/add/delete

In [47]:
df1 = df.reindex(index=dates[0:4],
                 columns=list(df.columns) + ['E'])

In [48]:
# pandas.DataFrame.loc - access a group of rows by labels or boolean array
# df1.loc[row, column] ...
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2018-01-01  0.000000  0.000000 -0.705316 -5  NaN  1.0
2018-01-02 -1.031795 -0.917170 -1.289025 -5 -1.0  1.0
2018-01-03 -0.521710 -1.325901 -1.213369 -5 -2.0  NaN
2018-01-04 -3.029376 -0.185764 -0.095235 -5 -3.0  NaN

In [49]:
# To drop any rows that have missing data
df1.dropna(how='any')

                   A        B         C  D    F    E
2018-01-02 -1.031795 -0.91717 -1.289025 -5 -1.0  1.0

In [50]:
# Filling missing data
df1.fillna(value=5)

                   A         B         C  D    F    E
2018-01-01  0.000000  0.000000 -0.705316 -5  5.0  1.0
2018-01-02 -1.031795 -0.917170 -1.289025 -5 -1.0  1.0
2018-01-03 -0.521710 -1.325901 -1.213369 -5 -2.0  5.0
2018-01-04 -3.029376 -0.185764 -0.095235 -5 -3.0  5.0

In [51]:
# To get the boolean mask where values are nan
pd.isna(df1)

                A      B      C      D      F      E
2018-01-01  False  False  False  False   True  False
2018-01-02  False  False  False  False  False  False
2018-01-03  False  False  False  False  False   True
2018-01-04  False  False  False  False  False   True

# Operation

In [52]:
# Operation in general exclude missing data
# Performing a descriptive statistic:
df.mean()

A   -1.154582
B   -0.659177
C   -0.798081
D   -5.000000
F   -3.000000
dtype: float64

In [53]:
# Same operation by on the other axis:
df.mean(1)

2018-01-01   -1.426329
2018-01-02   -1.847598
2018-01-03   -2.012196
2018-01-04   -2.262075
2018-01-05   -2.188375
2018-01-06   -2.682901
Freq: D, dtype: float64

In [54]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=list(range(0, 6))).shift(2)

In [55]:
df.sub(s, axis='index')

                      A   B   C   D   F
2018-01-01 00:00:00 NaN NaN NaN NaN NaN
2018-01-02 00:00:00 NaN NaN NaN NaN NaN
2018-01-03 00:00:00 NaN NaN NaN NaN NaN
2018-01-04 00:00:00 NaN NaN NaN NaN NaN
2018-01-05 00:00:00 NaN NaN NaN NaN NaN
2018-01-06 00:00:00 NaN NaN NaN NaN NaN
0                   NaN NaN NaN NaN NaN
1                   NaN NaN NaN NaN NaN
2                   NaN NaN NaN NaN NaN
3                   NaN NaN NaN NaN NaN
4                   NaN NaN NaN NaN NaN
5                   NaN NaN NaN NaN NaN

# Apply

In [56]:
# Applying functions to the data:
df.apply(np.cumsum)

                   A         B         C   D     F
2018-01-01  0.000000  0.000000 -0.705316  -5   NaN
2018-01-02 -1.031795 -0.917170 -1.994340 -10  -1.0
2018-01-03 -1.553505 -2.243071 -3.207709 -15  -3.0
2018-01-04 -4.582881 -2.428835 -3.302944 -20  -6.0
2018-01-05 -5.151945 -2.965058 -4.139534 -25 -10.0
2018-01-06 -6.927494 -3.955063 -4.788487 -30 -15.0

In [57]:
df.apply(lambda x: x.max() - x.min())

A    3.029376
B    1.325901
C    1.193790
D    0.000000
F    4.000000
dtype: float64

In [58]:
s = pd.Series(['A', 'B', 'C', 'Aaba', np.nan, 'CABA', 'dog', 'cat'])

In [59]:
s

0       A
1       B
2       C
3    Aaba
4     NaN
5    CABA
6     dog
7     cat
dtype: object

In [60]:
# Convert the pandas series s to lower case
s.str.lower()

0       a
1       b
2       c
3    aaba
4     NaN
5    caba
6     dog
7     cat
dtype: object

# Merge

In [61]:
# Easily combining together Series, DataFrame and Pandas
# 10 rows and 4 columns
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.270907  0.935624  0.165263 -0.485694
1 -1.435401  3.661423 -0.666889  1.120024
2 -0.781182 -0.191091 -1.334049  1.599778
3  1.187399  0.045794 -2.653903 -1.160959
4  0.263731 -0.683224  1.977123  1.369482
5 -0.470251  2.107633 -1.749199  0.436239
6 -1.963475 -0.138029 -0.941053  0.242634
7 -1.815446  0.602143  0.574132 -1.077998
8 -1.855972 -1.702817 -0.360332  0.150524
9  1.147646 -0.531693  0.217150 -1.331668

In [62]:
# Break it into pieces
# Note pieces is actually list of pandas DataFrame
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.270907  0.935624  0.165263 -0.485694
 1 -1.435401  3.661423 -0.666889  1.120024
 2 -0.781182 -0.191091 -1.334049  1.599778,
           0         1         2         3
 3  1.187399  0.045794 -2.653903 -1.160959
 4  0.263731 -0.683224  1.977123  1.369482
 5 -0.470251  2.107633 -1.749199  0.436239
 6 -1.963475 -0.138029 -0.941053  0.242634,
           0         1         2         3
 7 -1.815446  0.602143  0.574132 -1.077998
 8 -1.855972 -1.702817 -0.360332  0.150524
 9  1.147646 -0.531693  0.217150 -1.331668]

In [63]:
type(pieces)

list

In [64]:
type(pieces[1])

pandas.core.frame.DataFrame

In [65]:
pd.concat(pieces)

          0         1         2         3
0 -0.270907  0.935624  0.165263 -0.485694
1 -1.435401  3.661423 -0.666889  1.120024
2 -0.781182 -0.191091 -1.334049  1.599778
3  1.187399  0.045794 -2.653903 -1.160959
4  0.263731 -0.683224  1.977123  1.369482
5 -0.470251  2.107633 -1.749199  0.436239
6 -1.963475 -0.138029 -0.941053  0.242634
7 -1.815446  0.602143  0.574132 -1.077998
8 -1.855972 -1.702817 -0.360332  0.150524
9  1.147646 -0.531693  0.217150 -1.331668

# Join

In [66]:
# SQL style merges
left = pd.DataFrame({'key':['foo', 'foo'], 'lval':[1, 2]})
right = pd.DataFrame({'key':['foo', 'foo'], 'rval':[4, 5]})